import 'package:get/get.dart';

class Messages extends Translations {
  @override
  Map<String, Map<String, String>> get keys => {
        'zh_CN': {
          '首页': '首页',
          '客户名称:': '客户名称:',
          '客户电话:': '客户电话:',
          '客户地址:': '客户地址:',
          '位置照片:': '位置照片:',
          '通知': '通知',
          '未查询到地址信息': '未查询到地址信息',
          '客户无定位信息': '客户无定位信息:',
          '运单编号/会员编号': '运单编号/会员编号',
          '数据加载中..': '数据加载中..',
          '网络错误': '网络错误',
          '用户名或者密码错误!': '用户名或者密码错误!',
          '请求失败! 请稍后尝试!': '请求失败! 请稍后尝试!',
        },
        'ca_KH': {
          '绩效': 'ការវាយតម្លៃ',
          '累计工作日': 'ចំនួនថ្ងៃធ្វើការ',
          '日': 'ថ្ងៃ',
          '日均派送数量': 'ចំនួនចែកបានជាមធ្យមក្នុងមួយថ្ងៃ',
          '件': 'កញ្ចប់',
          '奖金': 'ប្រាក់រង្វាន់',
          '派送总数': 'ចំនួនចែកបាន',
          '运费合计': 'ថ្លៃដឹកជញ្ជូនសរុប',
          '提成合计': 'ប្រាក់កំរៃសរុប',
          '绩效说明': 'ការបញ្ជាក់ពីការវាយតម្លៃ',
          '日均派送数量': 'ចំនួនចែកបានជាមធ្យមក្នុងមួយថ្ងៃ',
          '奖励金额': 'ចំនួនប្រាក់រង្វាន់',
          '记住密码': 'ចងចាំពាក្យសម្ងាត់',
          '请检查网络连接是否正常': 'សូមពិនិត្យប្រព័ន្ធអ៊ីធីណេត',
          '请求超时请稍后尝试': 'ការស្នើសុំហួសពេល សូមសាកល្បងម្តងទៀតនៅពេលក្រោយ',
          '发送请求超时请稍后尝试': 'ការបញ្ជូនហួសពេល សូមសាកល្បងម្តងទៀតនៅពេលក្រោយ',
          '接收请求超时请稍后尝试': 'ការទទួលហួសពេល សូមសាកល្បងម្តងទៀតនៅពេលក្រោយ',
          '服务器响应状态错误': 'ប្រព័ន្ធខុសប្រក្រតី',
          '请求已取消': 'ការស្នើសុំត្រូវបានបញ្ឈប់',
          '其他错误': 'កំហុសផ្សេងៗ',
          '用户名密码错误': 'ពាក្យសម្ងាត់មិនត្រឺមត្រូវ',
          '请稍后尝试': 'សូមសាកល្បងម្តងទៀតនៅពេលក្រោយ',
        },
        'en_US': {
          '首页': 'Home',
        }
      };
}
